app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @post = Post.new(content: params[:content])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "アイアンマン：インクレディブル・ハルクという作品は置いておいて、MARVEL(MCU)作品を楽しみたい、沼りたい方はアイアンマンから観ることを強くオススメします。"], ["created_at", "2021-10-20 07:30:20.826177"], ["updated_at", "2021-10-20 07:30:20.826177"]]

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "スターウォーズ：2つの太陽とルーク\r\n最後のアナキンの匂わせる描写\r\nスターウォーズファンなら感動するシーンの数々\r\nディズニーが製作したスターウォーズなら\r\nこれが一番泣いた😭"], ["updated_at", "2021-10-20 07:28:41.480504"], ["id", 6]]

    def destroy
      @post = Post.find_by(id: params[:id])
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]