app/controllers/users_controller.rb

  def show
  @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    @user = User.new(name: params[:name], email: params[:email])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "窪田凌"], ["email", "0hh325532y01m4k@ezweb.ne.jp"], ["created_at", "2021-10-20 07:18:56.155381"], ["updated_at", "2021-10-20 07:18:56.155381"]]

  def edit
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ryouto"], ["email", "google4@co.jp"], ["updated_at", "2021-10-20 07:19:40.435489"], ["id", 3]]